// প্রাকটিস চ্যালেঞ্জ-১

// প্রতিদিন তোমার কাজ কি?
// ১) রাত ৮ টা বাজে মডিউল আনলক করো
// ২) ফটাফট ভিডিও দেখে দেখে প্রাকটিস করো
// ৩) ভিডিও দেখতে দেখতে নোটস নাও
// ৪) মডিউল শেষ হলে পুরা মডিউল নিজে নিজে প্রাকটিস করো
// ৫) কোন কিছু বুঝতে না পারলে (চিন্তা করে দেখো এইখানে কিন্তু একটা শর্ত আছে ), সাপোর্ট সেশনে জয়েন করো

// এখন তোমার কাজ হচ্ছে একটা for লুপ 5 বার চালিয়ে উপরের জিনিসগুলা আউটপুট হিসেবে দেখানো।
const myDayTask = [
  "১) রাত ৮ টা বাজে মডিউল আনলক করো",
  " ২) ফটাফট ভিডিও দেখে দেখে প্রাকটিস করো",
  "৩) ভিডিও দেখতে দেখতে নোটস নাও",
  "৪) মডিউল শেষ হলে পুরা মডিউল নিজে নিজে প্রাকটিস করো",
  "৫) কোন কিছু বুঝতে না পারলে (চিন্তা করে দেখো এইখানে কিন্তু একটা শর্ত আছে ), সাপোর্ট সেশনে জয়েন করো",
];

// For Loop

/* 
    for(let i = 0; i < myDayTask.length; i++){
    const myTask = myDayTask[i];
    console.log(myTask);
} 
*/

// প্রাকটিস চ্যালেঞ্জ-২:
// আবার একই জিনিস while লুপ চালিয়ে দেখানো।

/* 
    let i = 0;
    while(i < myDayTask.length){
    const myTask = myDayTask[i];
    console.log(myTask);
    i++;
} 
*/

// প্রাকটিস চ্যালেঞ্জ-৩:
// উপরের প্রব্লেমটাই while লুপ রিভার্স ওয়েতে (decremental হিসেবে)করে দেখাও
/* let i = myDayTask.length-1;
while( i >= 0){
    const myTask = myDayTask[i];
    console.log(myTask);
    i--;
} */

//প্রাকটিস চ্যালেঞ্জ-৪:
//উপরের প্রব্লেমটাই for লুপ রিভার্স ওয়েতে (decremental হিসেবে)করে দেখাও
for (let i = myDayTask.length - 1; i >= 0; i--) {
  const myTask = myDayTask[i];
  console.log(myTask);
}
